yooaroma/yoo_stm8s_sdcc/project/20_stm8s103_i2c_pcf8591/src/stm8s103_i2c_pcf8591_main.c
/**
 ******************************************************************************
 * @file stm8s103_i2c_pcf8591_main.c
 * @brief UART RX interrupt example.
 * @author yooaroma@gmail.com
 * @version V1.0.0
 * @date 2023.1.6
 ******************************************************************************
 */
/*
  info :
    STM8S103F3 MCU
    System Clock : 16MHz (HSI)
    UART1 : 115200, 8, N, 1
    TIM4 : 1msec interrupt
    TIM2 : PWM output : 1KHz, 50% duty cycle
    TIM2_CH1 : PD4
    STM8S103 MCU에서 I2C를 이용해 PCF8591(ADC/DAC 컨버터)을 제어하는 프로그램이다.
    PCF8591은 8비트 해상도를 가지며, 4개의 아날로그 입력(ADC)과 1개의 아날로그 출력(DAC)을 제공합니다. 
    이 칩의 기본 I2C 주소는 보통 0x90(Write) / 0x91(Read)입니다.
    
    1. 하드웨어 연결 (STM8S103 기준)
      VCC: 3.3V 또는 5V
      GND: Ground
      SCL: PB4 (STM8S103 I2C SCL)
      SDA: PB5 (STM8S103 I2C SDA)
      주의: SCL과 SDA 라인에는 반드시 4.7kΩ 정도의 풀업 저항이 연결되어 있어야 합니다.
*/

/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "stm8s_mib.h"
#include "string.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Hardware define */
/*
  // LEFT
  PD4 : D13
  PD5 : D14 : A3 : TXD
  PD6 : D15 : A4 : RXD
  RESET
  PA1 : D0  : KEY1
  PA2 : D1  : LED1
  GND
  5V
  3.3V
  PA3 : D2  : SS
  // RIGHT
  PD3 : D23 : A2
  PD2 : D11 : A1
  PD1 : D10 : SWIM
  PC7 : D9  : MISO
  PC6 : D8  : MOSI
  PC5 : D7  : SCK
  PC4 : D6  : A0
  PC3 : D5
  PB4 : D4  : SCA
  PB5 : LED : SDA
*/

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void CLK_Configuration(void);
void GPIO_Configuration(void);
void Toggle(void);
void key_released(void);
/* Private functions ---------------------------------------------------------*/
/* Global variables ----------------------------------------------------------*/
/* Public functions ----------------------------------------------------------*/

void i2c_pcf8591_info(void);
void tim2_pwm_test(uint16_t vwPeriod,uint16_t vwDuty);
uint16_t getKeyAdc(char vbAdcChannel);


////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
void TIM2_Cmd(FunctionalState NewState);
void TIM2_ARRPreloadConfig(FunctionalState NewState);
void TIM2_OC1PreloadConfig(FunctionalState NewState);
void TIM2_OC2PreloadConfig(FunctionalState NewState);
void TIM2_OC3PreloadConfig(FunctionalState NewState);
void TIM2_OC1Init(TIM2_OCMode_TypeDef TIM2_OCMode,
                  TIM2_OutputState_TypeDef TIM2_OutputState,
                  uint16_t TIM2_Pulse,
                  TIM2_OCPolarity_TypeDef TIM2_OCPolarity);
void TIM2_OC2Init(TIM2_OCMode_TypeDef TIM2_OCMode,
                  TIM2_OutputState_TypeDef TIM2_OutputState,
                  uint16_t TIM2_Pulse,
                  TIM2_OCPolarity_TypeDef TIM2_OCPolarity);
void TIM2_OC3Init(TIM2_OCMode_TypeDef TIM2_OCMode,
                  TIM2_OutputState_TypeDef TIM2_OutputState,
                  uint16_t TIM2_Pulse,
                  TIM2_OCPolarity_TypeDef TIM2_OCPolarity);
void TIM2_TimeBaseInit( TIM2_Prescaler_TypeDef TIM2_Prescaler,
                        uint16_t TIM2_Period);
void TIM2_DeInit(void);
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 ******************************************************************************
 * @brief Main function.
 * @par Parameters:
 * None
 * @retval void None
 * @par Required preconditions:
 * None
 ******************************************************************************
 */
void main(void)
{
  uint16_t vwSec = 0;
  uint16_t vwCh = 0;
  uint8_t vbIndex = 0;
  uint32_t vwData = 0;
  uint32_t pre_vwData = 0;
  uint32_t delta_data = 0;

  char line_buffer[31]; // 최대 30자 + NULL
  uint8_t index = 0;
  char c;

  // 파싱 결과 저장용 변수
  char cmd[10];
  int value_a;
  int value_b;
  int found;

  {
    /* Configures clocks */
    CLK_Configuration();

    /* Configures GPIOs */
    GPIO_Configuration();
  }
  {
    /* Configures TIM4 */
    tim4IrqInit();
  }
  {
    MibDebugInit(9600);
  }
  {
    enableInterrupts();
  }
  {
    MibWriteDebugStringCheck(1, "\r\n ###################################\r\n");
    // MibWriteDebugStringCheck(1," file name : "__FILE__"\r\n");
    mib_printf(" file name : ( %s )\r\n", __FILE__);
    mib_printf(" file line : ( %d )\r\n", __LINE__);
    MibWriteDebugStringCheck(1, " date :  " __DATE__ "  :  " __TIME__ "\r\n");
    MibWriteDebugStringCheck(1, " yooaroma.com by MYMEDIA Co., Ltd.\r\n");
    MibWriteDebugStringCheck(1, " ###################################\r\n");
  }
  {
    mib_printf("\r\n STM8S103 I2C PCF8591 Test Program Start...\r\n");
    I2C_Config();
  }
  {
    i2c_pcf8591_info();
  }
  {
    Toggle();
    MibWriteDebugByte('>'); // 문자 하나하나 에코 보냄
    do
    {
      if ((UCOM_KEY1_GPIO->IDR & UCOM_KEY1_PIN) == 0)
      {
        Toggle();
        key_released();
        vwSec = MibGetSecs();
      }
      else
      {
        if (vwSec != MibGetSecs())
        {
          vwSec = MibGetSecs();
          Toggle();
        }
      }
      {
        // 1. getchar()로 문자 하나 읽기
        vwCh = MibReadDebugByte();
        if (vwCh != MIB_DEBUG_READ_NODATA)
        {
          // 2. \n(또는 \r)을 만났을 때 처리
          if (vwCh == '\r' || vwCh == '\n')
          {
            line_buffer[index] = '\0'; // 문자열 종료
            MibWriteDebugByte('\r');
            MibWriteDebugByte('\n');// 터미널 줄바꿈 에코
            if (index > 0)
            {
              // 3. sscanf 호출하여 해석 (예: "SET 100" 형식)
              found = mib_sscanf(line_buffer, "%s %d %d", cmd, &value_a, &value_b);

              if (found >= 1)
              {
                // 해석 성공 시 처리 (예: 명령어 확인)
                if (strcmp(cmd, "pwm") == 0)
                {
                  mib_printf("\r\n %s [%d]usec period [%d]%% duty",cmd, value_a, value_b);
                  tim2_pwm_test(value_a, value_b); 
                }
                else if (strcmp(cmd, "adc") == 0)
                {
                  mib_printf("\r\n %s [%d] channel",cmd, value_a);
                  vwData = getKeyAdc(value_a);
                  mib_printf("\r\n ADC raw value = %d", (uint16_t)vwData);
                  vwData = (vwData * 3300) / 1023; // mV
                  mib_printf("\r\n ADC voltage = %d mV", (uint16_t)vwData);
                  vwData = (vwData * 100) / 3300; // %
                  mib_printf("\r\n ADC voltage = %d %%", (uint16_t)vwData);
                  if( vwData < 5)
                  {
                    vwData = 5;
                  }
                  else if( vwData > 95)
                  {
                    vwData = 95;
                  }
                  value_a = 2000; // 2 msec period
                  value_b = (uint16_t)vwData; // duty %
                  mib_printf("\r\n Set PWM : [%d]usec period [%d]%% duty", value_a, value_b);
                  tim2_pwm_test(value_a, value_b); 
                  mib_printf("\r\n");
                }                
                else if (strcmp(cmd, "pcfadc") == 0)
                {
                  mib_printf("\r\n %s [%d] channel",cmd, value_a);
                  vwData = PCF8591_ReadADC((uint8_t)value_a);
                  mib_printf("\r\n ADC raw value = %d", (uint16_t)vwData);
                  vwData = (vwData * 3300) / 255; // mV
                  mib_printf("\r\n ADC voltage = %d mV", (uint16_t)vwData);
                  vwData = (vwData * 100) / 3300; // %
                  mib_printf("\r\n ADC voltage = %d %%", (uint16_t)vwData);
                  if( vwData < 5)
                  {
                    vwData = 5;
                  }
                  else if( vwData > 95)
                  {
                    vwData = 95;
                  }
                  value_a = 2000; // 2 msec period
                  value_b = (uint16_t)vwData; // duty %
                  mib_printf("\r\n Set PWM : [%d]usec period [%d]%% duty", value_a, value_b);
                  tim2_pwm_test(value_a, value_b); 
                  mib_printf("\r\n");
                }              
                else if (strcmp(cmd, "pcfdac") == 0)
                {
                  mib_printf("\r\n %s [%d] dac data",cmd, value_a);
                  PCF8591_WriteDAC((uint8_t)value_a);
                  mib_printf("\r\n DAC raw value = %d", (uint16_t)value_a);
                  vwData = value_a;
                  vwData = (vwData * 3300) / 255; // mV
                  mib_printf("\r\n ADC voltage = %d mV", (uint16_t)vwData);
                  mib_printf("\r\n");
                }
                else if (strcmp(cmd, "auto") == 0)
                {
                  mib_printf("\r\n %s : key press auto adc to pwm",cmd);
                  pre_vwData = 0;
                  do {
                    value_a = 3; // ADC channel 3 : PD2
                    vwData = getKeyAdc(value_a);      
                    if(vwData > pre_vwData)
                    {
                      delta_data = vwData - pre_vwData;
                    }
                    else
                    {
                      delta_data = pre_vwData - vwData;
                    }
                    if(delta_data < 10)
                    {
                      delay_ms(100);                    
                      vwCh = MibReadDebugByte();
                      if (vwCh != MIB_DEBUG_READ_NODATA)
                      { 
                        break;  
                      }
                      continue;
                    }
                    pre_vwData = vwData;
                    mib_printf("\r\n ADC raw value = %d", (uint16_t)vwData);
                    vwData = (vwData * 3300) / 1023; // mV
                    mib_printf("\r\n ADC voltage = %d mV", (uint16_t)vwData);
                    vwData = (vwData * 100) / 3300; // %
                    mib_printf("\r\n ADC voltage = %d %%", (uint16_t)vwData);
                    if( vwData < 5)
                    {
                      vwData = 5;
                    }
                    else if( vwData > 95)
                    {
                      vwData = 95;
                    }
                    value_a = 2000; // 2 msec period
                    value_b = (uint16_t)vwData; // duty %
                    mib_printf("\r\n Set PWM : [%d]usec period [%d]%% duty", value_a, value_b);
                    tim2_pwm_test(value_a, value_b); 
                    mib_printf("\r\n");              
                  } while (1);
                }
                else if ((strcmp(cmd, "help") == 0) || (strcmp(cmd, "?") == 0))
                {
                  i2c_pcf8591_info();
                }
                else {
                  i2c_pcf8591_info();
                }
              }
            }
            index = 0; // 버퍼 인덱스 초기화
            MibWriteDebugByte('>'); // 문자 하나하나 에코 보냄
          }
          // 3. 일반 문자 처리 (최대 30자 제한)
          else
          {
            if (index < 30)
            {
              line_buffer[index++] = (uint8_t)vwCh;
              MibWriteDebugByte(vwCh); // 문자 하나하나 에코 보냄
            }
            else
            {
              // 버퍼가 꽉 찼을 때의 처리 (선택 사항: 경고음 등)
              index = 0; // 버퍼 인덱스 초기화
              MibWriteDebugByte('>'); // 문자 하나하나 에코 보냄
            }
          }
        }
      }
    } while (1);
  }
}

/**
 ******************************************************************************
 * @brief Configures clocks
 * @par Parameters:
 * None
 * @retval void None
 * @par Required preconditions:
 * None
 ******************************************************************************
 */
void CLK_Configuration(void)
{

  /* Fmaster = 16MHz */
  // CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
  // CLK_Configuration();
  {
    /* Clear High speed internal clock prescaler */
    CLK->CKDIVR &= (uint8_t)(~CLK_CKDIVR_HSIDIV);    
    /* Set High speed internal clock prescaler */
    CLK->CKDIVR |= (uint8_t)CLK_PRESCALER_HSIDIV1;
  }
}

/**
 ******************************************************************************
 * @brief Configures GPIOs
 * @par Parameters:
 * None
 * @retval void None
 * @par Required preconditions:
 * None
 ******************************************************************************
 */
void GPIO_Configuration(void)
{
  // /* GPIOD reset */
  // GPIO_DeInit(UCOM_LED1_GPIO);

  // /* Configure PD0 (LED1) as output push-pull low (led switched on) */
  // GPIO_Init(UCOM_LED1_GPIO, UCOM_LED1_PIN, UCOM_LED1_MODE);

  // GPIO_DeInit(UCOM_KEY1_GPIO);
  // /* Configure PA3 : KEY IN as input push-pull low (led switched on) */
  // GPIO_Init(UCOM_KEY1_GPIO, UCOM_KEY1_PIN, UCOM_KEY1_MODE);

