yooaroma/yoo_stm8s_sdcc/project/20_stm8s103_i2c_pcf8591/src/stm8s103_i2c_pcf8591_main.c
  /* Configure PD0 (LED1) as output push-pull low (led switched on) */
  // GPIO_Init(UCOM_LED1_GPIO, UCOM_LED1_PIN, UCOM_LED1_MODE);
  {
    UCOM_LED1_GPIO->DDR |= (UCOM_LED1_PIN);  /* Set Output mode */
    UCOM_LED1_GPIO->CR1 |= (UCOM_LED1_PIN);  /* Pull-Up or Push-Pull */
    UCOM_LED1_GPIO->CR2 |= (UCOM_LED1_PIN);  /* Output speed up to 10 MHz */
    UCOM_LED1_GPIO->ODR &= ~(UCOM_LED1_PIN); // low...
  }
  /* Configure PA3 : KEY IN as input push-pull low (led switched on) */
  // GPIO_Init(UCOM_KEY1_GPIO, UCOM_KEY1_PIN, UCOM_KEY1_MODE);
  {
    UCOM_KEY1_GPIO->DDR &= ~(UCOM_KEY1_PIN); /* Set input mode */
    UCOM_KEY1_GPIO->CR1 |= (UCOM_KEY1_PIN);  /* Pull-Up or Push-Pull */
    UCOM_KEY1_GPIO->CR2 &= ~(UCOM_KEY1_PIN); /*  External interrupt disabled */
  }
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 ******************************************************************************
 * @brief Toggle PD0 (Led LD1)
 * @par Parameters:
 * None
 * @retval void None
 * @par Required preconditions:
 * None
 ******************************************************************************
 */
void Toggle(void)
{
  // GPIO_WriteReverse(UCOM_LED1_GPIO, UCOM_LED1_PIN);
  UCOM_LED1_GPIO->ODR ^= (uint8_t)UCOM_LED1_PIN;
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
void key_released(void)
{
  uint16_t cnt;
  cnt = 0;
  do
  {
    if ((UCOM_KEY1_GPIO->IDR & UCOM_KEY1_PIN) != 0)
    {
      cnt++;
      if (cnt >= 2000)
        break;
    }
    else
    {
      cnt = 0;
    }
  } while (1);
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////

#ifdef USE_FULL_ASSERT

/**
 * @brief  Reports the name of the source file and the source line number
 *   where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval : None
 */
void assert_failed(u8 *file, u32 line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
/*
  info :
    STM8S103F3 MCU
    System Clock : 16MHz (HSI)
    UART1 : 115200, 8, N, 1
    TIM4 : 1msec interrupt
    TIM2 : PWM output : 1KHz, 50% duty cycle
    TIM2_CH1 : PD4

    STM8S Reference Manuals을 참고한다.

    stm8s 가 지니고 있는 PWM 기능에 대해서 공부한다.
    Channel 1 PWM 50% 2 KHz PD4 CN4.9
    Channel 2 PWM 25% 2 KHz PD3 CN4.8
    Channel 3 PWM 75% 2 KHz PA3 CN1.9
*/
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
#define _DEBUG_CMD_A_ 1
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
void i2c_pcf8591_info(void)
{
  MibWriteDebugStringCheck(1, " #################################\r\n");
  MibWriteDebugStringCheck(1, " # <help> or <?>                 #\r\n");
  MibWriteDebugStringCheck(1, " # PWM : Pulse Width Modulation  #\r\n");
  MibWriteDebugStringCheck(1, " # <pwm> [period] [duty]         #\r\n");
  MibWriteDebugStringCheck(1, " # PD4, usec, percent            #\r\n");
  MibWriteDebugStringCheck(1, " # pwm 1000 50  (1msec) (50%%)   #\r\n");
  MibWriteDebugStringCheck(1, " # <pcfadc> [channel number]     #\r\n");
  MibWriteDebugStringCheck(1, " # <pcfdac> [dac data]           #\r\n");
  MibWriteDebugStringCheck(1, " # pcfadc   0,1,2,3              #\r\n");
  MibWriteDebugStringCheck(1, " # pcfdac   0 to 255             #\r\n");
  MibWriteDebugStringCheck(1, " # PD2, AIN3                     #\r\n");
  MibWriteDebugStringCheck(1, " # adc 3                         #\r\n");
  MibWriteDebugStringCheck(1, " # <auto>                        #\r\n");
  MibWriteDebugStringCheck(1, " #################################\r\n");
}
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
void tim2_pwm_test(uint16_t vwPeriod,uint16_t vwDuty) 
{
  #if 1
  // TIM2_PRESCALER_1
  // uint16_t vwPeriod = 1000;                         // 1 msec
  uint16_t vwCh1Ratio = (((16 * vwPeriod) / 100) * vwDuty);      // duty % of period
  // uint16_t vwCh1Ratio = ((16 * vwPeriod) / 2);      // 50% of period
  uint16_t vwCh2Ratio = ((16 * vwPeriod) / 5);      // 20% of period
  uint16_t vwCh3Ratio = ((16 * vwPeriod) / 10 * 7); // 70% of period

  mib_printf("\r\n  pwm start Period = %d usec", vwPeriod);
  mib_printf("\r\n  Ch1 PD4 = %d%% duty ", vwDuty);
  // mib_printf("\r\n  Ch1 PD4 = 50%% of period ");
  mib_printf("\r\n  Ch2 PD3 = 20%% of period ");
  mib_printf("\r\n  Ch3 PA3 = 70%% of period ");
  /* TIM2 Peripheral Configuration */
  // TIM2_DeInit();

  /* Set TIM2 Frequency to 2Mhz */
  /*
    16MHz / 1 = 16MHz
    1/16 * 1000 = 62.5uSec (주기)
    period_usec = (1/16) * value
    value = 16 * period_usec
  */
  TIM2_TimeBaseInit(TIM2_PRESCALER_1, (16 * vwPeriod) / 1 - 1);

